interfaces/src/main/resources/templates/RegistreerBewijs/02.00.0000/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:reg="http://registreerbewijs.bewijsregistratiedienst.led.vlaanderen.be">
    <soapenv:Header/>
    <soapenv:Body>
        <reg:RegistreerBewijs>
            <Verzoek>
                <Context>
                    <Naam>RegistreerBewijs</Naam>
                    <Versie>02.00.0000</Versie>
                    <Bericht>
                        <Type>VRAAG</Type>
                        <Tijdstip>
                            <Datum>2025-01-01</Datum>
                            <Tijd>12:00</Tijd>
                        </Tijdstip>
                        <Afzender>
                            <Identificatie>akb.vlaanderen.be/aiv/burgerloket-wwoom-mock</Identificatie>
                            <Referte>833dd928-ffc2-42fe-83d7-12e71d191f8d</Referte>
                            <Hoedanigheid>a1300</Hoedanigheid>
                        </Afzender>
                    </Bericht>
                </Context>
                <Vragen>
                    <Vraag>
                        <Referte>vraagreferte</Referte>
                        <Inhoud>
                            <Bewijsregistratie>
                                <Leverancier>
                                    <Naam>SUPPLIER</Naam>
                                    <Bewijsreferte>LED_REFERENCE</Bewijsreferte>
                                </Leverancier>
                                <PersoonUitgereikt>
                                    <INSZ>90010100123</INSZ>
                                </PersoonUitgereikt>
                                <Bewijs>
                                    <Authenticiteit>
                                        <Naam>AUTHENTICITY</Naam>
                                    </Authenticiteit>
                                    <Categorie>
                                        <Naam>CATEGORY</Naam>
                                    </Categorie>
                                    <Graad>
                                        <Naam>LEVEL</Naam>
                                    </Graad>
                                    <Onderwijsvorm>
                                        <Naam>EDUCATIONAL_METHOD</Naam>
                                    </Onderwijsvorm>
                                    <Bewijstype>
                                        <Naam>EVIDENCE_TYPE</Naam>
                                    </Bewijstype>
                                    <Bewijsstaat>
                                        <Naam>EVIDENCE_STATE</Naam>
                                    </Bewijsstaat>
                                    <Instantie>
                                        <Naam>AUTHORITY</Naam>
                                    </Instantie>
                                    <Onderwerp>
                                        <Code>SUBJECT_CODE</Code>
                                        <Naam>SUBJECT_NAME</Naam>
                                    </Onderwerp>
                                    <Uitreikingsdatum>
                                        <Jaar>2000</Jaar>
                                        <Maand>01</Maand>
                                        <Dag>01</Dag>
                                    </Uitreikingsdatum>
                                    <VolledigeNaam>COURSE_FULL_NAME</VolledigeNaam>
                                    <Land>
                                        <Code>COUNTRY</Code>
                                    </Land>
                                    <Taal>
                                        <Code>LANGUAGE</Code>
                                    </Taal>
                                    <Instelling>
                                        <Naam>INSTITUTION_NAME</Naam>
                                        <Nummer>123456</Nummer>
                                    </Instelling>
                                    <Schooltype>
                                        <Naam>SCHOOL_TYPE</Naam>
                                    </Schooltype>
                                    <Studierichting>
                                        <Naam>DISCIPLINE_NAME</Naam>
                                        <Code>DISCIPLINE_CODE</Code>
                                    </Studierichting>
                                    <Specialisatie>
                                        <Naam>SPECIALISATION_NAME</Naam>
                                        <Code>SPECIALISATION_CODE</Code>
                                    </Specialisatie>
                                    <DetailOnderwerp>
                                        <Naam>DETAIL_SUBJECT_NAME</Naam>
                                        <Code>DETAIL_SUBJECT_CODE</Code>
                                    </DetailOnderwerp>
                                    <Vervalperiode>EXPIRATION_PERIOD</Vervalperiode>
                                    <UrenVolwassenenonderwijs>0</UrenVolwassenenonderwijs>
                                    <AlternatieveInstanties>
                                        <AlternatieveInstantie>
                                            <Instantierol>
                                                <Naam>ALTERNATIVE_AUTHORITY_ROLE</Naam>
                                            </Instantierol>
                                            <Instantie>
                                                <Naam>ALTERNATIVE_AUTHORITY_NAME</Naam>
                                            </Instantie>
                                        </AlternatieveInstantie>
                                    </AlternatieveInstanties>
                                    <BijkomendeInformaties>
                                        <BijkomendeInformatie>
                                            <Naam>ADDITIONAL_INFO_NAME</Naam>
                                            <Inhoud>ADDITIONAL_INFO_CONTENT</Inhoud>
                                        </BijkomendeInformatie>
                                    </BijkomendeInformaties>
                                </Bewijs>
                            </Bewijsregistratie>
                        </Inhoud>
                    </Vraag>
                </Vragen>
            </Verzoek>
        </reg:RegistreerBewijs>
    </soapenv:Body>
</soapenv:Envelope>